app/Controllers/MultistepController.php

    public function viewData()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `user`