app/Models/UserModel.php

    public function get_users($limit, $offset, $search = '', $gender = '')
{
    $builder = $this->db->table('users');

    // Apply search filter
    if (!empty($search)) {
        $builder->like('name', $search);
        $builder->orLike('email', $search);
    }

    // Apply gender filter
    if (!empty($gender)) {
        $builder->where('gender', $gender);
    }

    // Fetch paginated data
    $data = $builder->limit($limit, $offset)->get()->getResultArray();

    // Count total rows for the filtered query
    $builder->resetQuery();
    if (!empty($search)) {
        $builder->like('name', $search);
        $builder->orLike('email', $search);
    }
    if (!empty($gender)) {
        $builder->where('gender', $gender);
    }
    $totalRows = $builder->countAllResults();
---
SELECT *
FROM `users`
WHERE `name` LIKE '%komal%' ESCAPE '!'
OR  `email` LIKE '%komal%' ESCAPE '!'
AND `gender` = 'male'
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `name` LIKE '%komal%' ESCAPE '!'
OR  `email` LIKE '%komal%' ESCAPE '!'
AND `gender` = 'male'